import datetime,csv,time,random 
random.seed


LexsikoPerigrafis = {
    '1':'Δημιουργία προγράμματος σε γλώσσα python',
    '2':'Έπίλυση αλγορίθμου βελτιστοιποίησης',
    '3':'Μελέτη αλγορίθμου μυρμηγκιών',
    '4':'Εύρεση ιστορικών πληροφοριών για την γλώσσα Java',
    '5':'Εύρεση παραδειγμάτων εφαρμογής της Java',
    '6':'Κατηγοροιοποίηση μαθηματικών προβλημάτων',
    '7':'Αξιολόγηση γραπτών',
    '8':'Ερευνητική εργασία',
    '9':'Εργαστηριακή εργασία',
    '10':'Πειραματική εργασία',
}
LexsikoOnomatwn = {
    '1':'Λυδία',
    '2':'Κωσταντίνα',
    '3':'Ορφέας',
    '4':'Γιάννης',
    '5':'Χαρά',
    '6':'Αιμιλία',
    '7':'Νικολέτα',
    '8':'Χάρης',
    '9':'Γιώργος',
    '10':'Αριάδνη',
}


NeaLidia="Nealidia"
f = open('DiaxeiriErgasiwn.csv', 'r')
for line in f:	
    if 	"t6u" in line:
        print(line)	
        line=NeaLidia
        print(line)	
f.close
